## base
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecr_repository.cartography must be replaced
-/+ resource "aws_ecr_repository" "cartography" {
      ~ arn                  = "arn:aws:ecr:ca-central-1:794722365809:repository/ecs/cloud_asset_inventory/cartography" -> (known after apply)
      ~ id                   = "ecs/cloud_asset_inventory/cartography" -> (known after apply)
      ~ name                 = "ecs/cloud_asset_inventory/cartography" -> "security-tools/cloud_asset_inventory/cartography" # forces replacement
      ~ registry_id          = "794722365809" -> (known after apply)
      ~ repository_url       = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/ecs/cloud_asset_inventory/cartography" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ encryption_configuration {
          ~ kms_key         = "arn:aws:kms:ca-central-1:794722365809:key/465381ce-855c-4f13-b1d9-427f1ddee696" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_ecr_repository.neo4j_ingestor must be replaced
-/+ resource "aws_ecr_repository" "neo4j_ingestor" {
      ~ arn                  = "arn:aws:ecr:ca-central-1:794722365809:repository/ecs/cloud_asset_inventory/neo4j_ingestor" -> (known after apply)
      ~ id                   = "ecs/cloud_asset_inventory/neo4j_ingestor" -> (known after apply)
      ~ name                 = "ecs/cloud_asset_inventory/neo4j_ingestor" -> "security-tools/cloud_asset_inventory/neo4j_ingestor" # forces replacement
      ~ registry_id          = "794722365809" -> (known after apply)
      ~ repository_url       = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/ecs/cloud_asset_inventory/neo4j_ingestor" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ encryption_configuration {
          ~ kms_key         = "arn:aws:kms:ca-central-1:794722365809:key/465381ce-855c-4f13-b1d9-427f1ddee696" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ cartography_repository_url    = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/ecs/cloud_asset_inventory/cartography" -> (known after apply)
  ~ neo4j_ingestor_repository_url = "794722365809.dkr.ecr.ca-central-1.amazonaws.com/ecs/cloud_asset_inventory/neo4j_ingestor" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.cartography"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.neo4j_ingestor"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

19 tests, 16 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
